// let num = prompt("Введите число для введения в квадрат!")
// // Во внутрь переменной num мы передаем функцию prompt
// num = num ** 2
// // Мы изменили переменную num и возвели ее значение в квадрат
// // + Сложение (num = num + 1) - значение переменной увеличится на 1
// // - Вычетание (num = num - 1) - значение переменной уменьшится на 1
// // * Умножение (num = num * 1) - значение переменной умножится на 1
// // / Деление (num = num / 1) - значение переменной разделится на 1
// // % - Взятие остатка от деления (num = num %)
// alert(num)
// // Выводит значение num на экран
// **********************************************************************************************************************************

// let num_First = Number(prompt("Введите первое число"))
// let num_Second = Number(prompt("Введите второе число"))
// let Middle = num_First + num_Second / 2
// alert(Middle)

//***********************************************************************************************************************************

let num = Number(prompt("Введите длину стороны квадрата"))
num = num * num
alert(num)